import Image from "next/image";

export default function Description() {
  return (
    <div
      dir="rtl"
      className="w-11/12 flex flex-col md:gap-14 max-md:gap-10 py-14 md:pt-24 mx-auto"
    >
      <h1 className="font-black text-xl sm:text-2xl text-right">
        توضیحات کلی در مورد رمز ارزها
      </h1>
      <div className="text-base leading-8 text-right">
        رمز ارز ها از پروتکل های رمزگرافیکی و یا کد های فوق العاده پیچیده برای
        رمز گذاری دیتاهای حساس و انتقال آن ها استفاده می کنند تا معاملات امنی را
        فراهم کنند. توسعه دهندگان رمز ارزها این پروتکل ها را بر پایه اصول
        پیچیده ریاضیات و مهندسی کامپیوتر بنا کرده اند که آن ها را غیرقابل نفوذ
        می کند. این پروتکل ها همچنین هویت افراد استفاده کننده از رمز ارز ها را
        مخفی نگه می دارد و ردیابی و پیدا کردن آن ها را برای هر کسی و هر دولتی
        دشوار می کند. رمز ارزها همچنین برای کنترل شدن غیر متمرکز خود شناخته می
        شوند. این به آن معناست که تمام فعالیت ها و ارزش های این بازار توسط
        همان کد های پیچیده کنترل و ارزیابی می شوند و بانک ها و یا مقامات دولت ها
        کنترلی روی آن ها ندارند. ارزهای دیجیتال امکان معامله شدن توسط ارزهای
        واقعی را نیز دارا می باشند و شما می توانید در بعضی از مارکت های خاص و
        صرافی های شناخته شده، مانند بایننس (Binance)، ارز های دیجیتال خود را
        با دلار، پوند، یورو و غیره جایگزین کنید. خطر اصلی در همین مرحله اتفاق
        می افتد جایی که هکر ها و بدافزار ها امکان بلوکه کردن پول شما را در حین
        این انتقال دارا هستند.
      </div>
      <div className="w-full flex items-center justify-center">
        <Image
          src="/images/info-lg.png"
          alt="اطلاعات کلی در مورد رمزارزها - سایز دسکتاپ"
          width={750}
          height={750} 
          className="max-lg:hidden object-contain rounded-3xl"
          priority={false}
        />
        <Image
          src="/images/info-md.png"
          alt="اطلاعات کلی در مورد رمزارزها - سایز تبلت"
          width={700}
          height={700}
          className="max-sm:hidden lg:hidden object-contain rounded-3xl"
          priority={false}
        />
        <Image
          src="/images/info-sm.png"
          alt="اطلاعات کلی در مورد رمزارزها - سایز موبایل"
          width={350}
          height={350} 
          className="sm:hidden object-contain rounded-3xl"
          priority={false}
        />
      </div>
      <div className="text-base leading-8 text-right">
        رمز ارز ها از پروتکل های رمزگرافیکی و یا کد های فوق العاده پیچیده برای
        رمز گذاری دیتاهای حساس و انتقال آن ها استفاده می کنند تا معاملات امنی را
        فراهم کنند. توسعه دهندگان رمز ارزها این پروتکل ها را بر پایه اصول
        پیچیده ریاضیات و مهندسی کامپیوتر بنا کرده اند که آن ها را غیرقابل نفوذ
        می کند. این پروتکل ها همچنین هویت افراد استفاده کننده از رمز ارز ها را
        مخفی نگه می دارد و ردیابی و پیدا کردن آن ها را برای هر کسی و هر دولتی
        دشوار می کند. رمز ارزها همچنین برای کنترل شدن غیر متمرکز خود شناخته می
        شوند. این به آن معناست که تمام فعالیت ها و ارزش های این بازار توسط
        همان کد های پیچیده کنترل و ارزیابی می شوند و بانک ها و یا مقامات دولت ها
        کنترلی روی آن ها ندارند. ارزهای دیجیتال امکان معامله شدن توسط ارزهای
        واقعی را نیز دارا می باشند و شما می توانید در بعضی از مارکت های خاص و
        صرافی های شناخته شده، مانند بایننس (Binance)، ارز های دیجیتال خود را
        با دلار، پوند، یورو و غیره جایگزین کنید. خطر اصلی در همین مرحله اتفاق
        می افتد جایی که هکر ها و بدافزار ها امکان بلوکه کردن پول شما را در حین
        این انتقال دارا هستند.
      </div>
    </div>
  );
}